
# Приветственное сообщение
WELCOME_MESSAGE = "Добро пожаловать в систему рекомендаций по видеоиграм!"

# Форматы запросов
HELP_MESSAGE = """
Форматы доступных запросов:
- 'Мне нравятся жанры RPG, shooter' - для получения рекомендаций по жанрам.
- 'Рекомендованные игры от разработчика Bethesda' - для поиска игр от конкретного разработчика.
- 'Порекомендуй игры на платформе PC' - для получения рекомендаций игр на определенной платформе.
- 'Какие игры являются мультиплатформенными?' - для поиска мультиплатформенных игр.
- 'Порекомендуй игры с элементами действия' - для получения игр с экшн-элементами.
- 'Есть ли игра Skyrim на платформе PC?' - для проверки доступности игры на платформе.
- 'Рекомендованные игры от известных разработчиков' - для поиска игр от известных разработчиков.
"""

# Сообщения ошибок
INPUT_ERROR_MESSAGE = "Ошибка: Некорректный формат ввода. Пожалуйста, попробуйте снова."
EXIT_MESSAGE = "До свидания!"
INTERRUPT_MESSAGE = "\nПрерывание. До свидания!"
EOF_ERROR_MESSAGE = "\nЗавершение ввода. До свидания!"

# Подсказка для ввода
INPUT_PROMPT = "\nВведите Ваш запрос (или 'выход' для завершения): "
